
//필드란 클래스의 구성 요소인 필드에 대해서 알아보자 car라는 객체가 있을 거다 자동차는 이름,번호를 가지고 있고
//가지고 있는 것을 속성 이라고 말한다.
//자바에서는 이러한 속성을 필드라는 용어로 이용한다.
//학교에서 공부하는 학생은 학생은 이름,학번등을 속성으로 가지고 있다.
//한반이 20명 있다면 학생 객체가 20개 있다고 한다.
//각 학생은 이름으로 구별이 된다.이름이 구별된다는 것은 객체 별로 속성의 값이 유지된다.

public class Car {

    //필드는 변수를 선언하는 것과 비슷하게
    //타입 (변수명)필드명
    //Car객체는 이름과 번호를 가지고 있기 때문에
    //이름을 나타 낼수 있는 타입은 문자열을 나타낼수있는 스트링 타입으로
    String name;
    //번호는 숫자
    int number;
    //Car라는 클래스에 이름과 번호를 필드로 선언한 것

    static int width =100;
    static int height =250;




















}
